validation/moldCHT-cooled/0/cavity/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Cavity temperature: air initially at 300 K, melt enters at 480 K; the
    top face is the conjugate interface to the mould.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/cavity";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 480;
    }

    vent
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    cavityBottom
    {
        type            zeroGradient;
    }

    cavity_to_mold
    {
        type            coupledTemperature;
        Tnbr            T;
        value           $internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
