validation/moldCHT-cooled/constant/cavity/moldingDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Fluid region moulding dictionary: single filling stage (no packing),
    ejection unreachable and no viscous dissipation so that the global
    energy balance of the benchmark closes.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/cavity";
    object      moldingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    meltTemperature  480;
}

packing
{
    switchFraction   1;
    switchPressure   1e9;

    pressure
    {
        type            constant;
        value           1e5;
    }
}

cooling
{
    ejectionTemperature  100;
    releasePressure      1e5;
}

// The vent stays open for the whole benchmark so that the cavity never
// pressurises after filling (the pressure-work contribution to the energy
// balance stays negligible)
ventSealAlpha   2;

trapAirInterval 0;

viscousDissipation  false;

// ************************************************************************* //
