validation/moldCHT-cooled/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Multi-region filling benchmark: a 60 x 2 mm channel cavity filled by
    moldingFoam from the left while a 60 x 5 mm mould block above it is
    solved by the solid module through the conjugate interface.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regionSolvers
{
    cavity          moldingFoam;
    mold            solid;
}

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          1e-05;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  on;

maxCo           0.5;

maxAlphaCo      0.05;

maxDeltaT       0.01;

// ************************************************************************* //
