validation/moldCHT-cooled/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\      /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Cell zones for the two fill regions: the cavity box and the mould box
    are non-overlapping and splitMeshRegions turns them into meshes.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    cavity;
        type    cellZoneSet;
        action  new;
        source  boxToCell;
        box     (0 -0.001 -0.001) (0.06 0.002 0.003);
    }

    {
        name    mold;
        type    cellZoneSet;
        action  new;
        source  boxToCell;
        box     (0 0.002 -0.001) (0.06 0.007 0.003);
    }
);

// ************************************************************************* //
